depth = -1000;

dialog_index = 0;
type_pos = 0;
type_speed = 1;
done_typing = false;

dialog_lines = [
    {who: "artem",    text: "Чувак, можешь рассказать мне, кто такой Борзен?"},
    {who: "wanderer", text: "Борзен? Это тот, кто охраняет планету грязи."},
    {who: "wanderer", text: "Он жирный. Прямо реально жирный. Видно его прослойки жира."},
    {who: "wanderer", text: "Он пёс, но мыслит как человек. Гладков держит его на цепи."},
    {who: "wanderer", text: "Тут нет полиции, нет законов. Можно высказывать всё, что угодно."},
    {who: "wanderer", text: "Но тут есть казни. Например, тебя погружают в свалку, и ты умираешь от голода."},
    {who: "wanderer", text: "Будь осторожен. Гладков может убить тебя."},
    {who: "wanderer", text: "Этот псих жрет чипсы 5G с утра до ночи, поэтому у него снесло крышу."},
    {who: "wanderer", text: "Надеюсь, ты выиграешь. А то Борзен снова начнет лаять по ночам."},
    {who: "artem",    text: "Спасибо за информацию."}
];