// ПРИНУДИТЕЛЬНЫЙ РАЗМЕР GUI, ЧТОБЫ ТЕКСТ НЕ ПЛЫЛ
display_set_gui_size(640, 360);

depth = -1000;
dialog_index = 0;
type_pos = 0;
type_speed = 1;
done_typing = false;

// Твой текст
dialog_lines = [
    {who: "note", text: "Записка номер 1."},
    {who: "note", text: "День 420 на этой планете."},
    {who: "note", text: "Никто не убирается. Это идеально."},
    {who: "note", text: "Мой раб Борзен принес мне еще пачку чипсов 5G,и доширак."},
    {who: "note", text: "Хороший мальчик, ты еще не подозреваешь, что станешь псом."},
    {who: "note", text: "Если ты читаешь это и ты чистый - БЕГИ."},
    {who: "note", text: "Я, Гладков Матвей, убью тебя, и окунаю в грязь."},
    {who: "note", text: "С уважением, Король Грязи."}
];