line_index = 0;
type_pos = 0;
type_speed = 0.5;
done_typing = false;
finished = false;

lines = [
    "Артём Прайм убил Махмуда и Жеку,",
    "поскольку считал их теми,",
    "кто мешает Артёму убираться.",
    "",
    "Артём не мог поверить,",
    "что его друзья мертвы.",
    "Ему было грустно.",
    "",
    "Он не спал всю ночь.",
    "Думал о них.",
    "Вспоминал, как они гуляли,",
    "играли в CS2, смеялись...",
    "",
    "И на следующий день он пошёл в школу.",
    "",
    "Он хотел прогулять географию",
    "и вспомнить о бывшей дружбе...",
    "",
    "но...",
    "",
    "Артём Прайм не остановится.",
    "Он уничтожит всех друзей Артёма",
    "во всех вселенных.",
    "",
    "Заставит всех Артёмов",
    "убираться вечно.",
    "",
    "Уборка - это смысл.",
    "Уборка - это жизнь.",
    "Уборка - это всё.",
    "",
    "И никто его не остановит."
];

// Chill музыка
if (audio_exists(snd_black_screen_music)) {
    if (!audio_is_playing(snd_black_screen_music)) {
        audio_stop_all();
        audio_play_sound(snd_black_screen_music, 5, true);
    }
}