depth = -1000;

dialog_index = 0;
type_pos = 0;
type_speed = 1;
done_typing = false;

dialog_lines = [
    {who: "artem",    text: "Эй, мужик! Ты живой?"},
    {who: "survivor", text: "Тише! Он услышит..."},
    {who: "survivor", text: "Ты про Гладкова? Да, я знаю его."},
    {who: "survivor", text: "Он босс этой планеты. Худой, как палка."},
    {who: "survivor", text: "И он чуть-чуть в говне. Не спрашивай, как он там оказался."},
    {who: "survivor", text: "Жрет только чипсы 5G и доширак Петра. С утра до ночи."},
    {who: "survivor", text: "Ненавидит тех, кто чистый. Увидит чистюлю - сразу в грязь окунает."},
    {who: "survivor", text: "А этот пёс его, Борзен... Пёс, но мыслит как человек."},
    {who: "survivor", text: "Гладков держит его как раба. Заставляет охранять планету."},
    {who: "survivor", text: "А из-за чего тут всё в грязи? Так Гладков сам всё и засрал."},
    {who: "survivor", text: "Никто не убирается, потому что он запретил."},
    {who: "survivor", text: "Если пойдешь дальше - будь осторожен."},
    {who: "artem",    text: "Понял. Спасибо."}
];